Tekla.Structures.ModelInternal.EventThrottle
This class is used to throttle events that are triggered in quick succession.

Tekla.Structures.ModelInternal.EventThrottle.#ctor
Initializes a new instance of the Tekla.Structures.ModelInternal.EventThrottle class.

Tekla.Structures.ModelInternal.EventThrottle.ThrottledCall(System.Action)
This method is used to call an action with a throttle mechanism.
action:

Tekla.Structures.ModelInternal.EventThrottle.Dispose
